In [2]:
import pandas as pd
import numpy as np

In [3]:
df=pd.read_csv('C:/Users/Jayesh/Desktop/Mall_Customers.csv - Mall_Customers.csv.csv')

In [4]:
df

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

In [5]:
df['Age'].mode()

0    32
Name: Age, dtype: int64

In [6]:
df['Annual Income (k$)'].mode()

0    54
1    78
Name: Annual Income (k$), dtype: int64

In [7]:
df['Spending Score (1-100)'].mode()

0    42
Name: Spending Score (1-100), dtype: int64

In [8]:
df['Age'].median()

36.0

In [9]:
df['Annual Income (k$)'].median()

61.5

In [10]:
df['Spending Score (1-100)'].median()

50.0

In [11]:
df['Age'].std()

13.969007331558883

In [12]:
df['Annual Income (k$)'].std()

26.264721165271254

In [13]:
df['Spending Score (1-100)'].std()

25.823521668370162

In [14]:
df['Spending Score (1-100)'].mean()

50.2

In [15]:
df['Annual Income (k$)'].mean()

60.56

In [16]:
df['Age'].mean()

38.85

In [17]:
df.groupby(['Genre'])['Age'].describe()

        count       mean        std   min    25%   50%   75%   max
Genre
Female  112.0  38.098214  12.644095  18.0  29.00  35.0  47.5  68.0
Male     88.0  39.806818  15.514812  18.0  27.75  37.0  50.5  70.0

In [25]:
#group by age(categorical variable) display annual income
df.groupby(['Age'])['Annual Income (k$)'].mean()

Age
18     51.250000
19     57.000000
20     41.600000
21     38.800000
22     31.333333
23     41.500000
24     39.250000
25     57.666667
26     58.000000
27     63.166667
28     85.250000
29     63.600000
30     76.142857
31     48.375000
32     87.181818
33     80.333333
34     79.000000
35     46.666667
36     81.000000
37     65.000000
38     74.500000
39     72.666667
40     61.666667
41    101.000000
42     60.000000
43     65.666667
44     75.500000
45     69.333333
46     59.000000
47     70.166667
48     58.200000
49     51.000000
50     58.600000
51     55.500000
52     55.500000
53     39.500000
54     59.750000
55     57.000000
56     79.000000
57     64.500000
58     54.000000
59     65.250000
60     43.333333
63     56.500000
64     19.000000
65     50.500000
66     63.000000
67     45.500000
68     56.666667
69     44.000000
70     47.500000
Name: Annual Income (k$), dtype: float64

In [27]:
df.groupby(['Age'])['Annual Income (k$)'].sum()

Age
18    205
19    456
20    208
21    194
22     94
23    249
24    157
25    173
26    116
27    379
28    341
29    318
30    533
31    387
32    959
33    241
34    395
35    420
36    486
37    195
38    447
39    218
40    370
41    202
42    120
43    197
44    151
45    208
46    177
47    421
48    291
49    357
50    293
51    111
52    111
53     79
54    239
55     57
56     79
57    129
58    108
59    261
60    130
63    113
64     19
65    101
66    126
67    182
68    170
69     44
70     95
Name: Annual Income (k$), dtype: int64